###############################################################################
# Native apps                                                                 #
###############################################################################

# Add more formulae.
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Install web browsers.
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-chrome-canary'

# Install developer tools.
cask 'hyper'
cask 'insomnia'
cask 'visual-studio-code'

# Install productivity tools.
cask 'discord'
cask 'slack'

# Install messaging apps.
cask 'signal'
cask 'telegram'
cask 'whatsapp'

# Install other useful stuff.
cask '1password'
cask 'raycast'
cask 'spotify'
cask 'transmission'

# Install fonts.
cask 'font-fira-code'

###############################################################################
# Command-line tools                                                          #
###############################################################################

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, `g`-prefixed.
brew 'gnu-sed'

# Install GnuPG.
brew 'gnupg'
brew 'pinentry-mac'

# Install Zsh 5.
brew 'zsh'
brew 'zsh-completions'

# Install `wget`.
brew 'wget'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
#brew 'openssh'
brew 'screen'
brew 'php'
brew 'gmp'

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp' # `tcpserver` etc.
brew 'xpdf'
brew 'xz'

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'git-lfs'
brew 'gs'
brew 'imagemagick'
brew 'lua'
brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'ssh-copy-id'
brew 'tree'
brew 'vbindiff'
brew 'watchman'
brew 'zopfli'

# Install languages.
brew 'python'
brew 'ruby'
brew 'rustup'
