###############################################################################
# Native apps                                                                 #
###############################################################################

# Get Cask.
tap 'caskroom/cask'
tap 'caskroom/versions'

# Install web browsers.
cask 'google-chrome'
cask 'firefox'

# Install developer tools.
cask 'atom'
cask 'docker'
cask 'hyper'
cask 'paw'
cask 'visual-studio-code'

# Install productivity tools.
cask 'microsoft-office'
cask 'slack'

# Install other useful stuff.
cask 'java'
cask 'spotify'
cask 'xquartz'

###############################################################################
# Command-line tools                                                          #
###############################################################################

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']

# Install GnuPG.
brew 'gnupg'
brew 'pinentry-mac'

# Install Zsh 5.
brew 'zsh'
brew 'zsh-completions'

# Install `wget`.
brew 'wget'

# Install more recent versions of some macOS tools.
brew 'vim', args: ['with-override-system-vi']
brew 'grep'
#brew 'openssh'
brew 'screen'
tap 'homebrew/php'
brew 'homebrew/php/php56', args: ['with-gmp']

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp' # `tcpserver` etc.
brew 'xpdf'
brew 'xz'

# Install other useful binaries.
brew 'ack'
brew 'dark-mode'
#brew 'exiv2'
brew 'git'
brew 'git-lfs'
brew 'imagemagick', args: ['with-webp']
brew 'lua'
brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'rhino'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'
brew 'vbindiff'
brew 'watchman'
brew 'webkit2png'
brew 'zopfli'

# Install Node.js and yarn.
brew 'node'
brew 'yarn'

# Install Python.
brew 'python'
brew 'python3'
