###############################################################################
# Native apps                                                                 #
###############################################################################

# Install web browsers.
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'

# Install developer tools.
cask '1password-cli'
cask 'claude-code'
cask 'codex'
cask 'cursor'
cask 'docker-desktop'
cask 'iterm2'
cask 'postman'
cask 'visual-studio-code'

# Install productivity tools.
cask 'caffeine'
cask 'loom'
cask 'notion'
cask 'obsidian'
cask 'raycast'
cask 'zoom'

# Install messaging apps.
cask 'discord'
cask 'signal'
cask 'slack'
cask 'telegram'
cask 'whatsapp'

# Install security & privacy tools.
cask 'keybase'
cask 'little-snitch'
cask 'nordvpn'

# Install other useful stuff.
cask '1password'
cask 'macwhisper'
cask 'spotify'

# Install Java.
cask 'zulu@17'

###############################################################################
# Command-line tools                                                          #
###############################################################################

# Install GNU core utilities (those that come with macOS are outdated).
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, `g`-prefixed.
brew 'gnu-sed'

# Install GnuPG.
brew 'gnupg'
brew 'pinentry-mac'

# Install Zsh 5.
brew 'zsh'
brew 'zsh-completions'

# Install `wget`.
brew 'wget'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
brew 'screen'
brew 'php'
brew 'gmp'

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp' # `tcpserver` etc.
brew 'xpdf'
brew 'xz'

# Install other useful binaries.
brew 'ack'
brew 'gh'
brew 'ghostscript'
brew 'git'
brew 'git-lfs'
brew 'imagemagick'
brew 'lua'
brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'poppler'
brew 'pure'
brew 'pv'
brew 'redis'
brew 'rename'
brew 'ssh-copy-id'
brew 'tesseract-lang'
brew 'tree'
brew 'vbindiff'
brew 'watchman'
brew 'zopfli'

# Install mobile development tools.
brew 'cocoapods'
brew 'fastlane'

###############################################################################
# VS Code extensions                                                          #
###############################################################################

vscode 'bradlc.vscode-tailwindcss'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'esbenp.prettier-vscode'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'github.github-vscode-theme'
vscode 'prisma.prisma'
vscode 'tyriar.sort-lines'

###############################################################################
# Cargo                                                                       #
###############################################################################

cargo 'avm'
